online_store_app/app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "orders"
---
  def index
  	@total_orders = Order.count