online_store_app/app/controllers/lineitems_controller.rb

  def index
    @lineitems = Lineitem.all
---
SELECT "lineitems".* FROM "lineitems"

  def create

    product = Product.find(params[:product_id])
    @line_item = @cart.add_item(product.id)

    # @line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-11-30 07:02:40.084960"], ["updated_at", "2017-11-30 07:02:40.084960"]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 3], ["cart_id", 1], ["created_at", "2017-11-30 07:02:40.871019"], ["updated_at", "2017-11-30 07:02:40.871019"]]
UPDATE "lineitems" SET "quantity" = ?, "updated_at" = ? WHERE "lineitems"."id" = ?  [["quantity", 2], ["updated_at", "2017-11-30 07:40:24.453471"], ["id", 6]]