online_store_app/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Toy"], ["description", "This is a toy for sale"], ["image", "toy.png"], ["price", 2.0], ["created_at", "2017-11-29 05:44:56.295107"], ["updated_at", "2017-11-29 05:44:56.295107"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?
---
  def update
    respond_to do |format|
      if @product.update(product_params)