online_store_app/app/controllers/shopper_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%14%' OR image LIKE '%14%' OR description LIKE '%14%' OR price LIKE '%14%') ORDER BY "products"."name" ASC
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC
---
  def index
  	if params[:term]
    	@products = Product.where("name LIKE ? OR image LIKE ? OR description LIKE ? OR price LIKE ?", "%#{params[:term]}%", "%#{params[:term]}%", "%#{params[:term]}%", "%#{params[:term]}%").order(:name)
  	else
  		@products = Product.order(:name)