online_store_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def index
    # @users = User.all
    @users = User.order(:name)

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "abhi"], ["password_digest", "$2a$10$33.LMhv2Zh8rtMBJbGt1IeKnvepcDasAjn1sciCQJ3HI/acCX1gvm"], ["created_at", "2017-11-30 22:29:23.961908"], ["updated_at", "2017-11-30 22:29:23.961908"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "snk"], ["password_digest", "$2a$12$69KlUU5wiGlaFM.Qyo1AzuiFpgNkq1Y/oJFuY4h0JUBiiz0C6iuq2"], ["updated_at", "2019-12-12 20:57:46.200644"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)